saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LM4F_DFP.1.0.0.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>LM4F_DFP</name>
  <description>Texas Instruments LM4F Series Device Support</description>

  <releases>
    <release version="1.0.0">
      First Release version of TI LM4F Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Texas Instruments</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package TI LM4F</keyword>
    <keyword>LM4F</keyword>
    <keyword>Luminary</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="LM4F Series" Dvendor="Texas Instruments:16">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1"/>
      <book    name="Documents\dui0553a_cortex_m4_dgug.pdf"           title="Cortex-M4 Generic User Guide"/>
        <description>
TI's LM4F Series is a digital signal controller for embedded applications requiring a high level of integration and low power dissipation.
Typical applications include Point-of-sale terminals, web servers, multi-protocol bridges, Automation controllers, application control, robotics control, Audio, MP3 decoderscar alarms, GPS/fleet monitors

  - LCD Controller (1024x768x24) for STN and TFT
  - CRC Engine
  - Event Recorder
  - Quad SPI Flash interface (SPIFI)
  - Motor control PWM for three-phase motor
  - Unique ID for each device
        </description>

        <feature type="CAN"           n="2"/>
        <feature type="USBOTG"        n="1"/>
        <feature type="UART"          n="8"/>
        <feature type="I2C"           n="6"/>
        <feature type="ComOther"      n="6"                           name="Synchronous Serial Interface"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
        <feature type="ComOther"      n="16"                          name="Synchronous Serial Interface"/>
        <feature type="DMA"           n="1"/>
        <feature type="Timer"         n="6"       m="32"/>
        <feature type="Timer"         n="6"       m="64"              name="64Bit Timer"/>
        <feature type="WDT"           n="2"/>
        <feature type="RTC"           n="1"/>
        <feature type="PWM"           n="2"/>
        <feature type="Other"         n="2"                           name="Quadrature Encoder Interface (QEI)"/>
        <feature type="Temp"          n="-40"     m="85"/>


      <!-- ************************  Subfamily 'LM4F1xx'  **************************** -->
      <subFamily DsubFamily="LM4F1xx">
      
      <!-- *************************  Device 'LM4F110B2QR'  ***************************** -->
      <device Dname="LM4F110B2QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F110B2QR.h"  define="LM4F110"/>
        <debug      svd="SVD\LM4F110B2QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x3000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_32.FLM"        start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="43"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F110C4QR'  ***************************** -->
      <device Dname="LM4F110C4QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F110C4QR.h"  define="LM4F110"/>
        <debug      svd="SVD\LM4F110C4QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_64.FLM"        start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="43"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F110E5QR'  ***************************** -->
      <device Dname="LM4F110E5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F110E5QR.h"  define="LM4F110"/>
        <debug      svd="SVD\LM4F110E5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_128.FLM"       start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="43"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F110H5QR'  ***************************** -->
      <device Dname="LM4F110H5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F110H5QR.h"  define="LM4F110"/>
        <debug      svd="SVD\LM4F110H5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="43"/>
        <feature type="QFP"           n="64"/>
      </device>
      
