saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LM4F_DFP.1.0.0.pdsc
      <!-- *************************  Device 'LM4F111B2QR'  ***************************** -->
      <device Dname="LM4F111B2QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F111B2QR.h"  define="LM4F111"/>
        <debug      svd="SVD\LM4F111B2QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x3000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_32.FLM"        start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="49"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F111C4QR'  ***************************** -->
      <device Dname="LM4F111C4QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F111C4QR.h"  define="LM4F111"/>
        <debug      svd="SVD\LM4F111C4QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_64.FLM"        start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="49"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F111E5QR'  ***************************** -->
      <device Dname="LM4F111E5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F111E5QR.h"  define="LM4F111"/>
        <debug      svd="SVD\LM4F111E5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_128.FLM"       start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="49"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F111H5QR'  ***************************** -->
      <device Dname="LM4F111H5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F111H5QR.h"  define="LM4F111"/>
        <debug      svd="SVD\LM4F111H5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="49"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F112C4QC'  ***************************** -->
      <device Dname="LM4F112C4QC">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F112C4QC.h"  define="LM4F112"/>
        <debug      svd="SVD\LM4F112C4QC.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_64.FLM"        start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="69"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'LM4F112E5QC'  ***************************** -->
      <device Dname="LM4F112E5QC">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F112E5QC.h"  define="LM4F112"/>
        <debug      svd="SVD\LM4F112E5QC.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_128.FLM"       start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="69"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'LM4F112H5QC'  ***************************** -->
      <device Dname="LM4F112H5QC">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F112H5QC.h"  define="LM4F112"/>
        <debug      svd="SVD\LM4F112H5QC.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="69"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'LM4F112H5QD'  ***************************** -->
      <device Dname="LM4F112H5QD">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F112H5QD.h"  define="LM4F112"/>
        <debug      svd="SVD\LM4F112H5QD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="105"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'LM4F120B2QR'  ***************************** -->
      <device Dname="LM4F120B2QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F120B2QR.h"  define="LM4F120"/>
        <debug      svd="SVD\LM4F120B2QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x3000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_32.FLM"        start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="43"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F120C4QR'  ***************************** -->
      <device Dname="LM4F120C4QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F120C4QR.h"  define="LM4F120"/>
        <debug      svd="SVD\LM4F120C4QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_64.FLM"        start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="43"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F120E5QR'  ***************************** -->
      <device Dname="LM4F120E5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F120E5QR.h"  define="LM4F120"/>
        <debug      svd="SVD\LM4F120E5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_128.FLM"       start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="43"/>
        <feature type="QFP"           n="64"/>
      </device>
      
