saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LM4F_DFP.1.0.0.pdsc
      <!-- *************************  Device 'LM4F120H5QR'  ***************************** -->
      <device Dname="LM4F120H5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F120H5QR.h"  define="LM4F120"/>
        <debug      svd="SVD\LM4F120H5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="43"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F121B2QR'  ***************************** -->
      <device Dname="LM4F121B2QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F121B2QR.h"  define="LM4F121"/>
        <debug      svd="SVD\LM4F121B2QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x3000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_32.FLM"        start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="49"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F121C4QR'  ***************************** -->
      <device Dname="LM4F121C4QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F121C4QR.h"  define="LM4F121"/>
        <debug      svd="SVD\LM4F121C4QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_64.FLM"        start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="49"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F121E5QR'  ***************************** -->
      <device Dname="LM4F121E5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F121E5QR.h"  define="LM4F121"/>
        <debug      svd="SVD\LM4F121E5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_128.FLM"       start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="49"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F121H5QR'  ***************************** -->
      <device Dname="LM4F121H5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F121H5QR.h"  define="LM4F121"/>
        <debug      svd="SVD\LM4F121H5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="49"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F122C4QC'  ***************************** -->
      <device Dname="LM4F122C4QC">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F122C4QC.h"  define="LM4F122"/>
        <debug      svd="SVD\LM4F122C4QC.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_64.FLM"        start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="69"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'LM4F122E5QC'  ***************************** -->
      <device Dname="LM4F122E5QC">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F122E5QC.h"  define="LM4F122"/>
        <debug      svd="SVD\LM4F122E5QC.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_128.FLM"       start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="69"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'LM4F122H5QC'  ***************************** -->
      <device Dname="LM4F122H5QC">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F122H5QC.h"  define="LM4F122"/>
        <debug      svd="SVD\LM4F122H5QC.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="69"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'LM4F122H5QD'  ***************************** -->
      <device Dname="LM4F122H5QD">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F122H5QD.h"  define="LM4F122"/>
        <debug      svd="SVD\LM4F122H5QD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="105"/>
        <feature type="QFP"           n="144"/>
      </device>
      
