saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LM4F_DFP.1.0.0.pdsc
      <!-- *************************  Device 'LM4F132H5QD'  ***************************** -->
      <device Dname="LM4F132H5QD">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F132H5QD.h"  define="LM4F132"/>
        <debug      svd="SVD\LM4F132H5QD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="105"/>
        <feature type="QFP"           n="144"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'LM4F2xx'  **************************** -->
      <subFamily DsubFamily="LM4F2xx">
      
      <!-- *************************  Device 'LM4F210E5QR'  ***************************** -->
      <device Dname="LM4F210E5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F210E5QR.h"  define="LM4F210"/>
        <debug      svd="SVD\LM4F210E5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_128.FLM"       start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="43"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F210H5QR'  ***************************** -->
      <device Dname="LM4F210H5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F210H5QR.h"  define="LM4F210"/>
        <debug      svd="SVD\LM4F210H5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="43"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F211E5QR'  ***************************** -->
      <device Dname="LM4F211E5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F211E5QR.h"  define="LM4F211"/>
        <debug      svd="SVD\LM4F211E5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_128.FLM"       start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="49"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F211H5QR'  ***************************** -->
      <device Dname="LM4F211H5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F211H5QR.h"  define="LM4F211"/>
        <debug      svd="SVD\LM4F211H5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="49"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F212E5QC'  ***************************** -->
      <device Dname="LM4F212E5QC">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F212E5QC.h"  define="LM4F212"/>
        <debug      svd="SVD\LM4F212E5QC.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_128.FLM"       start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="69"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'LM4F212H5QC'  ***************************** -->
      <device Dname="LM4F212H5QC">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F212H5QC.h"  define="LM4F212"/>
        <debug      svd="SVD\LM4F212H5QC.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="69"/>
        <feature type="QFP"           n="100"/>
      </device>
      
