saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LM4F_DFP.1.0.0.pdsc
      <!-- *************************  Device 'LM4F212H5QD'  ***************************** -->
      <device Dname="LM4F212H5QD">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F212H5QD.h"  define="LM4F212"/>
        <debug      svd="SVD\LM4F212H5QD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="105"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'LM4F212H5BB'  ***************************** -->
      <device Dname="LM4F212H5BB">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F212H5BB.h"  define="LM4F212"/>
        <debug      svd="SVD\LM4F212H5BB.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="120"/>
        <feature type="BGA"           n="157"/>
      </device>
      
      <!-- *************************  Device 'LM4F230E5QR'  ***************************** -->
      <device Dname="LM4F230E5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F230E5QR.h"  define="LM4F230"/>
        <debug      svd="SVD\LM4F230E5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_128.FLM"       start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="43"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F230H5QR'  ***************************** -->
      <device Dname="LM4F230H5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F230H5QR.h"  define="LM4F230"/>
        <debug      svd="SVD\LM4F230H5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="43"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F231E5QR'  ***************************** -->
      <device Dname="LM4F231E5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F231E5QR.h"  define="LM4F231"/>
        <debug      svd="SVD\LM4F231E5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_128.FLM"       start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="49"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F231H5QR'  ***************************** -->
      <device Dname="LM4F231H5QR">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F231H5QR.h"  define="LM4F231"/>
        <debug      svd="SVD\LM4F231H5QR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="49"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'LM4F232E5QC'  ***************************** -->
      <device Dname="LM4F232E5QC">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F232E5QC.h"  define="LM4F232"/>
        <debug      svd="SVD\LM4F232E5QC.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_128.FLM"       start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="69"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'LM4F232H5QC'  ***************************** -->
      <device Dname="LM4F232H5QC">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F232H5QC.h"  define="LM4F232"/>
        <debug      svd="SVD\LM4F232H5QC.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="69"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'LM4F232H5QD'  ***************************** -->
      <device Dname="LM4F232H5QD">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F232H5QD.h"  define="LM4F232"/>
        <debug      svd="SVD\LM4F232H5QD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="105"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'LM4F232H5BB'  ***************************** -->
      <device Dname="LM4F232H5BB">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device\Include\LM4F232H5BB.h"  define="LM4F232"/>
        <debug      svd="SVD\LM4F232H5BB.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LM4F_256.FLM"       start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x1000"  default="1"/>
        <feature type="IOs"           n="120"/>
        <feature type="BGA"           n="157"/>
      </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

