saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LM4F_DFP.1.0.0.pdsc
    <condition id="LM4F CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>TI LM4F Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Texas Instruments:16" Dname="LM4F*"/>
    </condition>

    <condition id="LM4F110B2QR">
      <require Dname="LM4F110B2QR"/>
    </condition>
    <condition id="LM4F110C4QR">
      <require Dname="LM4F110C4QR"/>
    </condition>
    <condition id="LM4F110E5QR">
      <require Dname="LM4F110E5QR"/>
    </condition>
    <condition id="LM4F110H5QR">
      <require Dname="LM4F110H5QR"/>
    </condition>
    <condition id="LM4F111B2QR">
      <require Dname="LM4F111B2QR"/>
    </condition>
    <condition id="LM4F111C4QR">
      <require Dname="LM4F111C4QR"/>
    </condition>
    <condition id="LM4F111E5QR">
      <require Dname="LM4F111E5QR"/>
    </condition>
    <condition id="LM4F111H5QR">
      <require Dname="LM4F111H5QR"/>
    </condition>
    <condition id="LM4F112C4QC">
      <require Dname="LM4F112C4QC"/>
    </condition>
    <condition id="LM4F112E5QC">
      <require Dname="LM4F112E5QC"/>
    </condition>
    <condition id="LM4F112H5QC">
      <require Dname="LM4F112H5QC"/>
    </condition>
    <condition id="LM4F112H5QD">
      <require Dname="LM4F112H5QD"/>
    </condition>
    <condition id="LM4F120B2QR">
      <require Dname="LM4F120B2QR"/>
    </condition>
    <condition id="LM4F120C4QR">
      <require Dname="LM4F120C4QR"/>
    </condition>
    <condition id="LM4F120E5QR">
      <require Dname="LM4F120E5QR"/>
    </condition>
    <condition id="LM4F120H5QR">
      <require Dname="LM4F120H5QR"/>
    </condition>
    <condition id="LM4F121B2QR">
      <require Dname="LM4F121B2QR"/>
    </condition>
    <condition id="LM4F121C4QR">
      <require Dname="LM4F121C4QR"/>
    </condition>
    <condition id="LM4F121E5QR">
      <require Dname="LM4F121E5QR"/>
    </condition>
    <condition id="LM4F121H5QR">
      <require Dname="LM4F121H5QR"/>
    </condition>
    <condition id="LM4F122C4QC">
      <require Dname="LM4F122C4QC"/>
    </condition>
    <condition id="LM4F122E5QC">
      <require Dname="LM4F122E5QC"/>
    </condition>
    <condition id="LM4F122H5QC">
      <require Dname="LM4F122H5QC"/>
    </condition>
    <condition id="LM4F122H5QD">
      <require Dname="LM4F122H5QD"/>
    </condition>
    <condition id="LM4F130C4QR">
      <require Dname="LM4F130C4QR"/>
    </condition>
    <condition id="LM4F130E5QR">
      <require Dname="LM4F130E5QR"/>
    </condition>
    <condition id="LM4F130H5QR">
      <require Dname="LM4F130H5QR"/>
    </condition>
    <condition id="LM4F131C4QR">
      <require Dname="LM4F131C4QR"/>
    </condition>
    <condition id="LM4F131E5QR">
      <require Dname="LM4F131E5QR"/>
    </condition>
    <condition id="LM4F131H5QR">
      <require Dname="LM4F131H5QR"/>
    </condition>
    <condition id="LM4F132C4QC">
      <require Dname="LM4F132C4QC"/>
    </condition>
    <condition id="LM4F132E5QC">
      <require Dname="LM4F132E5QC"/>
    </condition>
    <condition id="LM4F132H5QC">
      <require Dname="LM4F132H5QC"/>
    </condition>
    <condition id="LM4F132H5QD">
      <require Dname="LM4F132H5QD"/>
    </condition>
    <condition id="LM4F210E5QR">
      <require Dname="LM4F210E5QR"/>
    </condition>
    <condition id="LM4F210H5QR">
      <require Dname="LM4F210H5QR"/>
    </condition>
    <condition id="LM4F211E5QR">
      <require Dname="LM4F211E5QR"/>
    </condition>
    <condition id="LM4F211H5QR">
      <require Dname="LM4F211H5QR"/>
    </condition>
    <condition id="LM4F212E5QC">
      <require Dname="LM4F212E5QC"/>
    </condition>
    <condition id="LM4F212H5QC">
      <require Dname="LM4F212H5QC"/>
    </condition>
    <condition id="LM4F212H5QD">
      <require Dname="LM4F212H5QD"/>
    </condition>
    <condition id="LM4F212H5BB">
      <require Dname="LM4F212H5BB"/>
    </condition>
    <condition id="LM4F230E5QR">
      <require Dname="LM4F230E5QR"/>
    </condition>
    <condition id="LM4F230H5QR">
      <require Dname="LM4F230H5QR"/>
    </condition>
    <condition id="LM4F231E5QR">
      <require Dname="LM4F231E5QR"/>
    </condition>
    <condition id="LM4F231H5QR">
      <require Dname="LM4F231H5QR"/>
    </condition>
    <condition id="LM4F232E5QC">
      <require Dname="LM4F232E5QC"/>
    </condition>
    <condition id="LM4F232H5QC">
      <require Dname="LM4F232H5QC"/>
    </condition>
    <condition id="LM4F232H5QD">
      <require Dname="LM4F232H5QD"/>
    </condition>
    <condition id="LM4F232H5BB">
      <require Dname="LM4F232H5BB"/>
    </condition>

  </conditions>

  <components>
      <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LM4F CMSIS Device">
        <!-- Cversion is necessary -->
        <description>System Startup for TI LM4F Series</description>

        <files>
          <!-- header files -->
          <file category="header" name="Device\Include\LM4F110B2QR.h"                                 condition="LM4F110B2QR" />
          <file category="header" name="Device\Include\LM4F110C4QR.h"                                 condition="LM4F110C4QR" />
          <file category="header" name="Device\Include\LM4F110E5QR.h"                                 condition="LM4F110E5QR" />
          <file category="header" name="Device\Include\LM4F110H5QR.h"                                 condition="LM4F110H5QR" />
          <file category="header" name="Device\Include\LM4F111B2QR.h"                                 condition="LM4F111B2QR" />
          <file category="header" name="Device\Include\LM4F111C4QR.h"                                 condition="LM4F111C4QR" />
          <file category="header" name="Device\Include\LM4F111E5QR.h"                                 condition="LM4F111E5QR" />
          <file category="header" name="Device\Include\LM4F111H5QR.h"                                 condition="LM4F111H5QR" />
          <file category="header" name="Device\Include\LM4F112C4QC.h"                                 condition="LM4F112C4QC" />
          <file category="header" name="Device\Include\LM4F112E5QC.h"                                 condition="LM4F112E5QC" />
          <file category="header" name="Device\Include\LM4F112H5QC.h"                                 condition="LM4F112H5QC" />
          <file category="header" name="Device\Include\LM4F112H5QD.h"                                 condition="LM4F112H5QD" />
          <file category="header" name="Device\Include\LM4F120B2QR.h"                                 condition="LM4F120B2QR" />
          <file category="header" name="Device\Include\LM4F120C4QR.h"                                 condition="LM4F120C4QR" />
          <file category="header" name="Device\Include\LM4F120E5QR.h"                                 condition="LM4F120E5QR" />
          <file category="header" name="Device\Include\LM4F120H5QR.h"                                 condition="LM4F120H5QR" />
          <file category="header" name="Device\Include\LM4F121B2QR.h"                                 condition="LM4F121B2QR" />
          <file category="header" name="Device\Include\LM4F121C4QR.h"                                 condition="LM4F121C4QR" />
          <file category="header" name="Device\Include\LM4F121E5QR.h"                                 condition="LM4F121E5QR" />
          <file category="header" name="Device\Include\LM4F121H5QR.h"                                 condition="LM4F121H5QR" />
          <file category="header" name="Device\Include\LM4F122C4QC.h"                                 condition="LM4F122C4QC" />
          <file category="header" name="Device\Include\LM4F122E5QC.h"                                 condition="LM4F122E5QC" />
          <file category="header" name="Device\Include\LM4F122H5QC.h"                                 condition="LM4F122H5QC" />
          <file category="header" name="Device\Include\LM4F122H5QD.h"                                 condition="LM4F122H5QD" />
          <file category="header" name="Device\Include\LM4F130C4QR.h"                                 condition="LM4F130C4QR" />
          <file category="header" name="Device\Include\LM4F130E5QR.h"                                 condition="LM4F130E5QR" />
          <file category="header" name="Device\Include\LM4F130H5QR.h"                                 condition="LM4F130H5QR" />
          <file category="header" name="Device\Include\LM4F131C4QR.h"                                 condition="LM4F131C4QR" />
          <file category="header" name="Device\Include\LM4F131E5QR.h"                                 condition="LM4F131E5QR" />
          <file category="header" name="Device\Include\LM4F131H5QR.h"                                 condition="LM4F131H5QR" />
          <file category="header" name="Device\Include\LM4F132C4QC.h"                                 condition="LM4F132C4QC" />
          <file category="header" name="Device\Include\LM4F132E5QC.h"                                 condition="LM4F132E5QC" />
          <file category="header" name="Device\Include\LM4F132H5QC.h"                                 condition="LM4F132H5QC" />
          <file category="header" name="Device\Include\LM4F132H5QD.h"                                 condition="LM4F132H5QD" />
          <file category="header" name="Device\Include\LM4F210E5QR.h"                                 condition="LM4F210E5QR" />
          <file category="header" name="Device\Include\LM4F210H5QR.h"                                 condition="LM4F210H5QR" />
          <file category="header" name="Device\Include\LM4F211E5QR.h"                                 condition="LM4F211E5QR" />
          <file category="header" name="Device\Include\LM4F211H5QR.h"                                 condition="LM4F211H5QR" />
          <file category="header" name="Device\Include\LM4F212E5QC.h"                                 condition="LM4F212E5QC" />
          <file category="header" name="Device\Include\LM4F212H5QC.h"                                 condition="LM4F212H5QC" />
          <file category="header" name="Device\Include\LM4F212H5QD.h"                                 condition="LM4F212H5QD" />
          <file category="header" name="Device\Include\LM4F212H5BB.h"                                 condition="LM4F212H5BB" />
          <file category="header" name="Device\Include\LM4F230E5QR.h"                                 condition="LM4F230E5QR" />
          <file category="header" name="Device\Include\LM4F230H5QR.h"                                 condition="LM4F230H5QR" />
          <file category="header" name="Device\Include\LM4F231E5QR.h"                                 condition="LM4F231E5QR" />
          <file category="header" name="Device\Include\LM4F231H5QR.h"                                 condition="LM4F231H5QR" />
          <file category="header" name="Device\Include\LM4F232E5QC.h"                                 condition="LM4F232E5QC" />
          <file category="header" name="Device\Include\LM4F232H5QC.h"                                 condition="LM4F232H5QC" />
          <file category="header" name="Device\Include\LM4F232H5QD.h"                                 condition="LM4F232H5QD" />
          <file category="header" name="Device\Include\LM4F232H5BB.h"                                 condition="LM4F232H5BB" />

          <!-- startup files -->
          <file category="source" name="Device\Source\ARM\Startup.s"         attr="config"/>

        </files>
      </component>

    </components>
  </package>
